{
  "nodes": [
    {
      "op": "null", 
      "name": "input_0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_0", 
      "attrs": {"__shape__": "(1, 1, 350, 350)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_sub", 
      "name": "imageinput_Sub", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1", 
      "attrs": {"__shape__": "(8, 1, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_2", 
      "attrs": {"__shape__": "(8,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3", 
      "attrs": {"__shape__": "(8,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_4", 
      "attrs": {"__shape__": "(8,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_5", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(8,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_6", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(8,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm_1", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 1], [9, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu_1", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_7", 
      "attrs": {"__shape__": "(16, 8, 5, 5)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_8", 
      "attrs": {"__shape__": "(16,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_9", 
      "attrs": {"__shape__": "(16,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_10", 
      "attrs": {"__shape__": "(16,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_11", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_12", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(16,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm_2", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu_2", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_13", 
      "attrs": {"__shape__": "(8, 16, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_14", 
      "attrs": {"__shape__": "(8,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_15", 
      "attrs": {"__shape__": "(8,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_16", 
      "attrs": {"__shape__": "(8,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_17", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(8,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_18", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(8,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm_3", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 1], [31, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu_3", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_19", 
      "attrs": {"__shape__": "(4, 14792)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "param_20", 
      "attrs": {"__shape__": "(4,)"}, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {"num_hidden": "4"}, 
      "inputs": [[36, 0, 0], [37, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax", 
      "attrs": {"axis": "1"}, 
      "inputs": [[40, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    14, 
    15, 
    17, 
    18, 
    19, 
    20, 
    25, 
    26, 
    28, 
    29, 
    30, 
    31, 
    37, 
    38
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48
  ], 
  "heads": [[41, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}